doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(setq user-full-name "Michael Reitmeir"
      user-mail-address "michi.reitmeir@gmail.com")

(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t                         ; Nobody likes to loose work, I certainly don't
      truncate-string-ellipsis "…"
      completion-ignore-case t)

(setq evil-vsplit-window-right t
      evil-split-window-below t)

(defconst doom-module-config-file (concat doom-user-dir "config.org"))
(defun open-emacs-config-file () "open `doom-module-config-file'"
  (interactive)
  (find-file doom-module-config-file))
(map! :leader
 (:prefix ("o" . "open")
       :desc "Emacs config"     "c"     #'open-emacs-config-file))

(setq shell-file-name (executable-find "bash"))

(setq emacs-everywhere-frame-name-format "emacs-everywhere")

(remove-hook 'emacs-everywhere-init-hooks #'emacs-everywhere-set-frame-position)

(setq emacs-everywhere-major-mode-function #'org-mode)
(add-hook 'emacs-everywhere-init-hooks 'org-mode)

(setq doom-font (font-spec :family "JetBrains Mono" :size 15 :weight 'regular)
      doom-variable-pitch-font (font-spec :family "Libertinus Sans" :size 19))
;;      doom-variable-pitch-font (font-spec :family "Fira Sans") ; inherits `doom-font''s :size
;;      doom-unicode-font (font-spec :family "Input Mono Narrow" :size 12)
;;      doom-big-font (font-spec :family "Fira Mono" :size 19))

(setq-default line-spacing 0.25)

(setq mixed-pitch-set-height t)

(map! :leader
 (:prefix ("t" . "toggle")
       :desc "Mixed pitch mode"       "m"     #'mixed-pitch-mode
       :desc "Variable pitch mode"    "v"     #'variable-pitch-mode
       )
      )

(map! :leader
 (:prefix ("t" . "toggle")
       :desc "Visible mode"           "V"     #'visible-mode
       )
      )

(setq doom-theme 'doom-one)

(use-package ewal)
(use-package ewal-doom-themes)

(defvar ewal-background-list
  '((default :background (ewal-load-color 'background))
    (separator-line :background (ewal-load-color 'background))
    (hl-line :background (ewal--color-chshade (ewal-load-color 'background) .1))
    (org-block :background (ewal--color-chshade (ewal-load-color 'background) -0.3))
        ;; Tabs:
    (tab-bar :background (ewal-load-color 'background))
    (tab-bar-tab :background (ewal--color-chshade (ewal-load-color 'background) .1))
    (tab-bar-tab-inactive :background (ewal--color-chshade (ewal-load-color 'background) .05))
    (tab-line :background (ewal-load-color 'background))
        ;; Mode line:
    (mode-line :background (ewal--color-chshade (ewal-load-color 'background) .15))
    (mode-line-inactive :background (ewal--color-chshade (ewal-load-color 'background) .05))
    (mode-line-emphasis :background (ewal--color-chshade (ewal-load-color 'background) .20))
        ;; minibuffer (underneath mode line) and stuff
    (solaire-default-face :background (ewal-load-color 'background)))
  "list of faces to customize when styling emacs with ewal")

(defvar ewal-background-active nil "non-nil if background is currently styled using ewal")

(defun toggle-ewal-background ()
  "toggle ewal background colors on and off"
  (interactive)
  (if ewal-background-active
        (doom/reload-theme)
        (dolist (spec ewal-background-list)
                (let ((face (nth 0 spec))
                (attribute (nth 1 spec))
                (value (nth 2 spec)))
                (set-face-attribute face nil attribute (eval value)))))
  (setq ewal-background-active (not ewal-background-active)))

(map! :leader
 (:prefix ("t" . "toggle")
       :desc "background colors"        "B"     #'toggle-ewal-background))

(after! (doom-themes org hl-line)
        (toggle-ewal-background))

(setq doom-modeline-height 35)

(after! doom-themes
