doom/config.org
** Dashboard (startup page)
I like this silly banner I found at [[https://github.com/jeetelongname/doom-banners]] for my dashboard. To fit with this, font color is changed to pink.
#+begin_src emacs-lisp
(after! doom-themes
    (custom-theme-set-faces! 'doom-one
        `(doom-dashboard-banner :foreground "pink" :weight bold)))
(setq fancy-splash-image "~/.config/doom/I-am-doom.png")
(setq +doom-dashboard-banner-padding '(0 . 4))
#+end_src

Now let's change the menu options on the dashboard. I added ~doom-dashboard-widget-projects~, which contains extra buttons for all projects known to projectile. The source code is adapted from the ~doom-dashboard-widget-shortmenu~ function.
#+begin_src emacs-lisp
(setq +doom-dashboard-functions
      '(doom-dashboard-widget-banner
        doom-dashboard-widget-shortmenu
        doom-dashboard-widget-projects))

(setq +doom-dashboard-menu-sections
 '(("Configure Emacs"
    :icon (concat (nerd-icons-icon-for-mode 'emacs-lisp-mode :face 'doom-dashboard-menu-title) " ")
    :action open-emacs-config-file
    :key "SPC o c")
   ("Take some notes"
    :icon (concat (nerd-icons-faicon "nf-fa-file_pen" :face 'doom-dashboard-menu-title) " ")
    :action org-roam-node-find-default
    :key "SPC r f")
   ("Read some literature"
    :icon (concat (nerd-icons-faicon "nf-fa-book" :face 'doom-dashboard-menu-title) " ")
    :action citar-open-files
    :key "SPC l f")
   ("Work on a project"
    :icon (concat (nerd-icons-faicon "nf-fa-code" :face 'doom-dashboard-menu-title) " ")
    :action projectile-switch-project
    :key "SPC p p")))

(require 'projectile)
(defface doom-dashboard-project
  '((t :inherit font-lock-string-face))
  "Face for projects on doom-dashboard.")
(defun doom-dashboard-widget-projects ()
  "Create list of menu buttons for each project in `projectile-known-projects', and bind key appropriately."
        (projectile-known-projects)
        (dolist (project projectile-known-projects)
         (insert
          (+doom-dashboard--center (- +doom-dashboard--width 1)
           ; put together three things:
           (format "%s %-35s%-2s\n"
            ; 1. the icons
            (nerd-icons-faicon "nf-fa-angle_right" :face 'doom-dashboard-project)
            ; 2. the project button
            (with-temp-buffer
             (insert-text-button project
                        'action `(lambda (_button) (let
                                ((projectile-switch-project-action 'magit-status))
                                (projectile-switch-project-by-name ,project)))
                        'face 'doom-dashboard-project
                        'follow-link t
                        'help-echo project)
             (buffer-string))
            ; 3. the number (with face and keybindings)
            (let* ((num (+ 1 (cl-position project projectile-known-projects)))
                  (str (number-to-string num)))
             (map! :map +doom-dashboard-mode-map :ng str
                   `(lambda () (interactive) (let
                                ((projectile-switch-project-action 'magit-status))
                                (projectile-switch-project-by-name ,project))))
             (add-text-properties 0 (length str) (list 'face 'doom-dashboard-menu-desc) str)
              str))))))
(after! (projectile doom)
    (setq! +workspaces-switch-project-function #'doom-project-browse)
    (add-to-list 'projectile-ignored-projects "~/.config/emacs/"))
#+end_src

The following is a hack to remove the blank lines between menu buttons. By investigating the last lines of the source code of ~doom-dashboard-widget-shortmenu~, one can see that the newlines are inserted if ~display-graphic-p~ returns true. So let's temporarily overwrite this function with ~ignore~, which always returns nil.
#+begin_src emacs-lisp
(defadvice! no-new-lines (oldfun)
  :around #'doom-dashboard-widget-shortmenu
  (cl-letf (((symbol-function 'display-graphic-p) #'ignore))
    (funcall oldfun)))
#+end_src

Let's also add some shorter keybindings to the dashboard.
#+begin_src emacs-lisp
(map! :map +doom-dashboard-mode-map
      :ng "c"       #'open-emacs-config-file
      :ng "r"       #'org-roam-node-find-default
      :ng "l"       #'citar-open-files
      :ng "p"       #'projectile-switch-project)
#+end_src

** Line Numbers, Wrapping and Margins
Display relative line numbers, but do so counting lines as displayed, not actual line breaks in the buffer.
#+begin_src emacs-lisp
(setq display-line-numbers-type 'visual)
#+end_src
This works well for me, because I like overlength lines to always automatically wrap.
#+begin_src emacs-lisp
(global-visual-line-mode t)
#+end_src
Maximum line length (when =word-wrap-mode= is active and =+word-wrap-fill-style= is set to ~'auto~ or ~'soft~, or when =perfect-margin-mode= is active)
#+begin_src emacs-lisp :tangle yes
(setq-default fill-column 110)
#+end_src

The [[https://github.com/mpwang/perfect-margin][perfect-margin]] package automatically centers windows if there is enough space for that. Keep in mind it needs to be installed with =(package! perfect-margin)= in ~package.el~.
#+begin_src emacs-lisp
(use-package! perfect-margin
  :config
  (after! doom-modeline
    (setq mode-line-right-align-edge 'right-fringe))
  (after! minimap
    ;; if you use (vc-gutter +pretty)
    ;; and theme is causing "Invalid face attribute :foreground nil"
    ;; (setq minimap-highlight-line nil)
    (setq minimap-width-fraction 0.08))
  ;; (setq perfect-margin-only-set-left-margin t)
  (perfect-margin-mode t)
  ;; make perfect-margin use fill-column as width
  (setq perfect-margin-visible-width -1))
(map! :leader
 (:prefix ("t" . "toggle")
       :desc "Perfect margin mode"  "p"     #'perfect-margin-mode))
#+end_src

However, in some modes the "perfect" margins don't make sense. The ~writeroom-width~ setting is overwritten by them, and with ~doom-big-font-mode~ there's simply not enough space. So let's filter those out. The dummy variable is there because ~perfect-margin-ignore-filters~ likes to call functions with the current window as parameter.
#+begin_src emacs-lisp
(add-to-list 'perfect-margin-ignore-filters '(lambda (window) (bound-and-true-p writeroom-mode)))
(add-to-list 'perfect-margin-ignore-filters '(lambda (window) (bound-and-true-p doom-big-font-mode)))
#+end_src
Big Font Mode is actually even more resilient: It doesn't seem to let ~perfect-margin-mode~ deactivate itself properly while ~doom-big-font-mode~ is active. So some advice is necessary...
#+begin_src emacs-lisp
(defadvice doom-big-font-mode (before deactivate-perfect-margins) (perfect-margin-mode 0))
#+end_src

With ~perfect-margin-mode~, the doom documentation needs a bit more space than its default ~80~. These ~80~ are specified in the ~.dir-locals.el~, so we need to override that.
#+begin_src emacs-lisp
(add-hook 'doom-docs-mode-hook
  (lambda ()
    (setq-local ignored-local-variables (push 'fill-column ignored-local-variables))
    (setq-local fill-column 90)))
#+end_src

** Zen/Writeroom
Zen mode (as it is called in doom emacs) or writeroom mode (the package it is based on) increases the font size, actives the mixed-pitch font and disables some possible distractions.
#+begin_src emacs-lisp
(setq writeroom-width 45)
(map! :leader
 (:prefix ("t" . "toggle")
       :desc "Global writeroom mode"  "W"     #'global-writeroom-mode))
#+end_src

