doom/config.el
    (custom-theme-set-faces! 'doom-one
        `(doom-dashboard-banner :foreground "pink" :weight bold)))
(setq fancy-splash-image "~/.config/doom/I-am-doom.png")
(setq +doom-dashboard-banner-padding '(0 . 4))

(setq +doom-dashboard-functions
      '(doom-dashboard-widget-banner
        doom-dashboard-widget-shortmenu
        doom-dashboard-widget-projects))

(setq +doom-dashboard-menu-sections
 '(("Configure Emacs"
    :icon (concat (nerd-icons-icon-for-mode 'emacs-lisp-mode :face 'doom-dashboard-menu-title) " ")
    :action open-emacs-config-file
    :key "SPC o c")
   ("Take some notes"
    :icon (concat (nerd-icons-faicon "nf-fa-file_pen" :face 'doom-dashboard-menu-title) " ")
    :action org-roam-node-find-default
    :key "SPC r f")
   ("Read some literature"
    :icon (concat (nerd-icons-faicon "nf-fa-book" :face 'doom-dashboard-menu-title) " ")
    :action citar-open-files
    :key "SPC l f")
   ("Work on a project"
    :icon (concat (nerd-icons-faicon "nf-fa-code" :face 'doom-dashboard-menu-title) " ")
    :action projectile-switch-project
    :key "SPC p p")))

(require 'projectile)
(defface doom-dashboard-project
  '((t :inherit font-lock-string-face))
  "Face for projects on doom-dashboard.")
(defun doom-dashboard-widget-projects ()
  "Create list of menu buttons for each project in `projectile-known-projects', and bind key appropriately."
        (projectile-known-projects)
        (dolist (project projectile-known-projects)
         (insert
          (+doom-dashboard--center (- +doom-dashboard--width 1)
           ; put together three things:
           (format "%s %-35s%-2s\n"
            ; 1. the icons
            (nerd-icons-faicon "nf-fa-angle_right" :face 'doom-dashboard-project)
            ; 2. the project button
            (with-temp-buffer
             (insert-text-button project
                        'action `(lambda (_button) (let
                                ((projectile-switch-project-action 'magit-status))
                                (projectile-switch-project-by-name ,project)))
                        'face 'doom-dashboard-project
                        'follow-link t
                        'help-echo project)
             (buffer-string))
            ; 3. the number (with face and keybindings)
            (let* ((num (+ 1 (cl-position project projectile-known-projects)))
                  (str (number-to-string num)))
             (map! :map +doom-dashboard-mode-map :ng str
                   `(lambda () (interactive) (let
                                ((projectile-switch-project-action 'magit-status))
                                (projectile-switch-project-by-name ,project))))
             (add-text-properties 0 (length str) (list 'face 'doom-dashboard-menu-desc) str)
              str))))))
(after! (projectile doom)
    (setq! +workspaces-switch-project-function #'doom-project-browse)
    (add-to-list 'projectile-ignored-projects "~/.config/emacs/"))

(defadvice! no-new-lines (oldfun)
  :around #'doom-dashboard-widget-shortmenu
  (cl-letf (((symbol-function 'display-graphic-p) #'ignore))
    (funcall oldfun)))

(map! :map +doom-dashboard-mode-map
      :ng "c"       #'open-emacs-config-file
      :ng "r"       #'org-roam-node-find-default
      :ng "l"       #'citar-open-files
      :ng "p"       #'projectile-switch-project)

(setq display-line-numbers-type 'visual)

(global-visual-line-mode t)

(setq-default fill-column 110)

(use-package! perfect-margin
  :config
  (after! doom-modeline
    (setq mode-line-right-align-edge 'right-fringe))
  (after! minimap
    ;; if you use (vc-gutter +pretty)
    ;; and theme is causing "Invalid face attribute :foreground nil"
    ;; (setq minimap-highlight-line nil)
    (setq minimap-width-fraction 0.08))
  ;; (setq perfect-margin-only-set-left-margin t)
  (perfect-margin-mode t)
  ;; make perfect-margin use fill-column as width
  (setq perfect-margin-visible-width -1))
(map! :leader
 (:prefix ("t" . "toggle")
       :desc "Perfect margin mode"  "p"     #'perfect-margin-mode))

(add-to-list 'perfect-margin-ignore-filters '(lambda (window) (bound-and-true-p writeroom-mode)))
(add-to-list 'perfect-margin-ignore-filters '(lambda (window) (bound-and-true-p doom-big-font-mode)))

(defadvice doom-big-font-mode (before deactivate-perfect-margins) (perfect-margin-mode 0))

(add-hook 'doom-docs-mode-hook
  (lambda ()
    (setq-local ignored-local-variables (push 'fill-column ignored-local-variables))
    (setq-local fill-column 90)))

(setq writeroom-width 45)
(map! :leader
 (:prefix ("t" . "toggle")
       :desc "Global writeroom mode"  "W"     #'global-writeroom-mode))
