doom/config.org
** Transparent Background
I like me some transparent backgrounds. This value controls the opacity if transparent background is enabled.
#+begin_src emacs-lisp
(defconst frame-default-opacity 90)
#+end_src
In contrast, the variable ~frame-opacity~ is used for the current opacity. So this variable is set to ~100~ if transparency is disabled.

Now follows a function to toggle the transparent background on and off.
#+begin_src emacs-lisp
(defvar opacity-type "full-frame" "Type of opacity to use. If set to \"background\" only the background will be transparent. If set to \"full-frame\", the entire frame will be transparent. Needs to be refreshed using `update-background-opacity'")
(defun update-background-opacity ()
        "update transparency to the value of `frame-opacity' and the type `opacity-type'"
        (interactive)
        (cond
         ((equal opacity-type "background")
                (set-frame-parameter (selected-frame) 'alpha-background frame-opacity)
                (set-frame-parameter (selected-frame) 'alpha 100))
          ((equal opacity-type "full-frame")
                (set-frame-parameter (selected-frame) 'alpha-background 100)
                (set-frame-parameter (selected-frame) 'alpha frame-opacity))))
(add-hook! 'doom-switch-frame-hook :append #'update-background-opacity)

(defun toggle-frame-opacity ()
        "toggle opacity of the frame"
        (interactive)
        (if (= frame-opacity 100)
            (setq frame-opacity frame-default-opacity)
            (setq frame-opacity 100))
        (update-background-opacity))
(defun toggle-opacity-type ()
        "toggle between transparent background and fully transparent frame"
        (interactive)
        (if (equal opacity-type "background")
            (setq opacity-type "full-frame")
            (setq opacity-type "background"))
        (update-background-opacity))

(map! :leader
 (:prefix ("t" . "toggle")
       :desc "transparent background"          "t"     #'toggle-frame-opacity
       :desc "transparency type"               "T"     #'toggle-opacity-type))
#+end_src
The background transparency has been added to emacs only [[https://kristofferbalintona.me/posts/202206071000/][somewhat recently]]. It doesn't work perfectly though, for example transparent PNG-images are not rendered as transparent, and it [[https://lists.gnu.org/archive/html/bug-gnu-emacs/2022-12/msg01080.html][doesn't look like this will be fixed soon]]. So I use the ~opacity-type~ to be able to choose which kind of transparency I want.

This will make the background transparent at startup.
#+begin_src emacs-lisp
(setq frame-opacity 100)
(toggle-frame-opacity)
#+end_src

** Whitespace
Highlight unnecessary or wrong use of whitespace (e.g. mixed tabs and spaces).
#+begin_src emacs-lisp
(use-package! whitespace
  :config (setq whitespace-style '(face empty indentation space-after-tab space-before-tab))
  (global-whitespace-mode +1))
#+end_src
Trailing whitespace doesn't need to be visualized, since it's removed on save anyway.

** Treemacs
By default, the treemacs window is not re-sizable. I don't see why.
#+begin_src emacs-lisp
(setq treemacs-width 30)
(setq treemacs--width-is-locked nil)
(setq treemacs-width-is-initially-locked nil)
#+end_src
Especially when using LaTeX, there's gonna be a lot of files in my directory which I don't actively care about. The following hides these files. (cf. [[https://tecosaur.github.io/emacs-config/config.html#treemacs][tecosaur]])
#+begin_src emacs-lisp :tangle yes
(after! treemacs
  (defvar treemacs-file-ignore-extensions '()
    "File extension which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-globs '()
    "Globs which will are transformed to `treemacs-file-ignore-regexps' which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-regexps '()
    "RegExps to be tested to ignore files, generated from `treeemacs-file-ignore-globs'")
  (defun treemacs-file-ignore-generate-regexps ()
    "Generate `treemacs-file-ignore-regexps' from `treemacs-file-ignore-globs'"
    (setq treemacs-file-ignore-regexps (mapcar 'dired-glob-regexp treemacs-file-ignore-globs)))
  (if (equal treemacs-file-ignore-globs '()) nil (treemacs-file-ignore-generate-regexps))
  (defun treemacs-ignore-filter (file full-path)
    "Ignore files specified by `treemacs-file-ignore-extensions', and `treemacs-file-ignore-regexps'"
    (or (member (file-name-extension file) treemacs-file-ignore-extensions)
        (let ((ignore-file nil))
          (dolist (regexp treemacs-file-ignore-regexps ignore-file)
            (setq ignore-file (or ignore-file (if (string-match-p regexp full-path) t nil)))))))
  (add-to-list 'treemacs-ignored-file-predicates #'treemacs-ignore-filter))

(setq treemacs-file-ignore-extensions
      '(;; LaTeX
        "aux"
        "ptc"
        "fdb_latexmk"
        "fls"
        "synctex.gz"
        "gz" ; the function actually recognizes the last '.', not the first; I don't think I'll ever need to look at .gz-files anyways
        "toc"
        ;; LaTeX - glossary
        "glg"
        "glo"
        "gls"
        "glsdefs"
        "ist"
        "acn"
        "acr"
        "alg"
        ;; LaTeX - pgfplots
        "mw"
        ;; LaTeX - pdfx
        "pdfa.xmpi"
        ;; further LaTeX stuff
        "bbl"
        "bcf"
        "blg"
        "nav"
        "out"
        "snm"
        "vrb"
        "tdl"
        ))
(setq treemacs-file-ignore-globs
      '(;; LaTeX
        "*/_minted-*"
        ;; AucTeX
        "*/.auctex-auto"
        "*/_region_.log"
        "*/_region_.tex"))
#+end_src

* Global Functionality
** Local Leader
I'm used to this from my VimTex days.
#+begin_src emacs-lisp
(setq doom-localleader-key ",")
#+end_src
** Move/Cut
I've always disliked that the delete command in vim automatically yanks the deleted text, i.e. it acts more like cutting than deleting.
For this reason I've configured 'd' and 'x' to not yank the deleted text, and instead defined 'm' (for "move", because 'c' is already taken) to delete and yank, i.e. cut.

First we clone the default ~evil-delete~ function under the name ~evil-cut~.
#+begin_src emacs-lisp
(setq wrapped-copy (symbol-function 'evil-delete))
(evil-define-operator evil-cut (BEG END TYPE REGISTER YANK-HANDLER)
  "Cut text from BEG to END with TYPE.

Save in REGISTER or in the kill-ring with YANK-HANDLER."
  (interactive "<R><x><y>")
  (funcall wrapped-copy BEG END TYPE REGISTER YANK-HANDLER))
#+end_src

Now we map ~evil-cut~ to 'm'.
#+begin_src emacs-lisp
(map! :n "m" 'evil-cut)
#+end_src

Finally, we automatically redirect all deletions to the black hole register, thus making 'd', 'x', and pasting over something only delete and not copy.
We also need to do it for ~evil-org-delete-char~, since that has different input arguments and an extra ~evil-yank~ in it's definition for some reason.
#+begin_src emacs-lisp
(defun bb/evil-delete (orig-fn beg end &optional type _ &rest args)
  (apply orig-fn beg end type ?_ args))
(advice-add 'evil-delete :around 'bb/evil-delete)
(advice-add 'evil-delete-char :around 'bb/evil-delete)

(defun bb/evil-org-delete-char (orig-fn count beg end &optional type _ &rest args)
  (apply orig-fn count beg end type ?_ args))
(advice-add 'evil-org-delete-char :around 'bb/evil-org-delete-char)
#+end_src
** Windows and Buffers
A key chord every time I want to switch windows or buffers is way too much work.
#+begin_src emacs-lisp :tangle yes
(map! :n   "ö"   'evil-next-buffer
      :n   "Ö"   'evil-prev-buffer
      :nig "C-ö" 'switch-to-buffer
      :nig "C-j" 'evil-window-next
      :nig "C-k" 'evil-window-prev
      :nig "C-l" 'evil-window-vsplit
      :nig "C-ä" 'evil-window-split)
(map! :after org
    :map org-mode-map
    "C-j" 'evil-window-next)
#+end_src

Tecosaur finds it handy to be asked which buffer to see after splitting a window. So do I. But let's tweak it so it only shows the buffers of the current workspace/perspective so I don't get overwhelmed. There's also no point in asking which buffer I want if there's only one available.
#+begin_src emacs-lisp
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (if (<= (length (persp-buffer-list)) 1) nil (call-interactively 'persp-switch-to-buffer)))
#+end_src

** Auto-complete
Increase time until auto-complete shows up.
#+begin_src emacs-lisp
(setq company-idle-delay 0.4)
#+end_src
** Search & Replace
Ok, I admit it: I never learned how to do search and replace properly in vim. It seems like too much to remember and type every time. So let's use emacs functions instead.
The ~replace-string~ and ~query-replace~ suit my needs the most, but by default they only operate from the current point to the end of the buffer, not on the whole buffer. This fixes that, while still working when used with a specific region selected (adapted from [[https://superuser.com/a/1152391][here]]).
#+begin_src emacs-lisp
(defun advice--replace-whole-buffer (oldfun &rest args)
        "advice for search functions to search the whole buffer (if not specified otherwise)"
        ;; set start pos
        (unless (nth 3 args)
                (setf (nth 3 args)
                (if (region-active-p)
                        (region-beginning)
                        (point-min))))
        (unless (nth 4 args)
                (setf (nth 4 args)
                (if (region-active-p)
                        (region-end)
                        (point-max))))
        (apply oldfun args))
(advice-add 'replace-string :around 'advice--replace-whole-buffer)
(advice-add 'query-replace :around 'advice--replace-whole-buffer)

(map! :n "C-s" 'replace-string
      :n "C-S-s" 'query-replace)
#+end_src

