doom/config.el

(defconst frame-default-opacity 90)

(defvar opacity-type "full-frame" "Type of opacity to use. If set to \"background\" only the background will be transparent. If set to \"full-frame\", the entire frame will be transparent. Needs to be refreshed using `update-background-opacity'")
(defun update-background-opacity ()
        "update transparency to the value of `frame-opacity' and the type `opacity-type'"
        (interactive)
        (cond
         ((equal opacity-type "background")
                (set-frame-parameter (selected-frame) 'alpha-background frame-opacity)
                (set-frame-parameter (selected-frame) 'alpha 100))
          ((equal opacity-type "full-frame")
                (set-frame-parameter (selected-frame) 'alpha-background 100)
                (set-frame-parameter (selected-frame) 'alpha frame-opacity))))
(add-hook! 'doom-switch-frame-hook :append #'update-background-opacity)

(defun toggle-frame-opacity ()
        "toggle opacity of the frame"
        (interactive)
        (if (= frame-opacity 100)
            (setq frame-opacity frame-default-opacity)
            (setq frame-opacity 100))
        (update-background-opacity))
(defun toggle-opacity-type ()
        "toggle between transparent background and fully transparent frame"
        (interactive)
        (if (equal opacity-type "background")
            (setq opacity-type "full-frame")
            (setq opacity-type "background"))
        (update-background-opacity))

(map! :leader
 (:prefix ("t" . "toggle")
       :desc "transparent background"          "t"     #'toggle-frame-opacity
       :desc "transparency type"               "T"     #'toggle-opacity-type))

(setq frame-opacity 100)
(toggle-frame-opacity)

(use-package! whitespace
  :config (setq whitespace-style '(face empty indentation space-after-tab space-before-tab))
  (global-whitespace-mode +1))

(setq treemacs-width 30)
(setq treemacs--width-is-locked nil)
(setq treemacs-width-is-initially-locked nil)

(after! treemacs
  (defvar treemacs-file-ignore-extensions '()
    "File extension which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-globs '()
    "Globs which will are transformed to `treemacs-file-ignore-regexps' which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-regexps '()
    "RegExps to be tested to ignore files, generated from `treeemacs-file-ignore-globs'")
  (defun treemacs-file-ignore-generate-regexps ()
    "Generate `treemacs-file-ignore-regexps' from `treemacs-file-ignore-globs'"
    (setq treemacs-file-ignore-regexps (mapcar 'dired-glob-regexp treemacs-file-ignore-globs)))
  (if (equal treemacs-file-ignore-globs '()) nil (treemacs-file-ignore-generate-regexps))
  (defun treemacs-ignore-filter (file full-path)
    "Ignore files specified by `treemacs-file-ignore-extensions', and `treemacs-file-ignore-regexps'"
    (or (member (file-name-extension file) treemacs-file-ignore-extensions)
        (let ((ignore-file nil))
          (dolist (regexp treemacs-file-ignore-regexps ignore-file)
            (setq ignore-file (or ignore-file (if (string-match-p regexp full-path) t nil)))))))
  (add-to-list 'treemacs-ignored-file-predicates #'treemacs-ignore-filter))

(setq treemacs-file-ignore-extensions
      '(;; LaTeX
        "aux"
        "ptc"
        "fdb_latexmk"
        "fls"
        "synctex.gz"
        "gz" ; the function actually recognizes the last '.', not the first; I don't think I'll ever need to look at .gz-files anyways
        "toc"
        ;; LaTeX - glossary
        "glg"
        "glo"
        "gls"
        "glsdefs"
        "ist"
        "acn"
        "acr"
        "alg"
        ;; LaTeX - pgfplots
        "mw"
        ;; LaTeX - pdfx
        "pdfa.xmpi"
        ;; further LaTeX stuff
        "bbl"
        "bcf"
        "blg"
        "nav"
        "out"
        "snm"
        "vrb"
        "tdl"
        ))
(setq treemacs-file-ignore-globs
      '(;; LaTeX
        "*/_minted-*"
        ;; AucTeX
        "*/.auctex-auto"
        "*/_region_.log"
        "*/_region_.tex"))

(setq doom-localleader-key ",")

(setq wrapped-copy (symbol-function 'evil-delete))
(evil-define-operator evil-cut (BEG END TYPE REGISTER YANK-HANDLER)
  "Cut text from BEG to END with TYPE.

Save in REGISTER or in the kill-ring with YANK-HANDLER."
  (interactive "<R><x><y>")
  (funcall wrapped-copy BEG END TYPE REGISTER YANK-HANDLER))

(map! :n "m" 'evil-cut)

(defun bb/evil-delete (orig-fn beg end &optional type _ &rest args)
  (apply orig-fn beg end type ?_ args))
(advice-add 'evil-delete :around 'bb/evil-delete)
(advice-add 'evil-delete-char :around 'bb/evil-delete)

(defun bb/evil-org-delete-char (orig-fn count beg end &optional type _ &rest args)
  (apply orig-fn count beg end type ?_ args))
(advice-add 'evil-org-delete-char :around 'bb/evil-org-delete-char)

(map! :n   "ö"   'evil-next-buffer
      :n   "Ö"   'evil-prev-buffer
      :nig "C-ö" 'switch-to-buffer
      :nig "C-j" 'evil-window-next
      :nig "C-k" 'evil-window-prev
      :nig "C-l" 'evil-window-vsplit
      :nig "C-ä" 'evil-window-split)
(map! :after org
    :map org-mode-map
    "C-j" 'evil-window-next)

(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (if (<= (length (persp-buffer-list)) 1) nil (call-interactively 'persp-switch-to-buffer)))

(setq company-idle-delay 0.4)

(defun advice--replace-whole-buffer (oldfun &rest args)
        "advice for search functions to search the whole buffer (if not specified otherwise)"
        ;; set start pos
        (unless (nth 3 args)
                (setf (nth 3 args)
                (if (region-active-p)
                        (region-beginning)
                        (point-min))))
        (unless (nth 4 args)
                (setf (nth 4 args)
                (if (region-active-p)
                        (region-end)
                        (point-max))))
        (apply oldfun args))
(advice-add 'replace-string :around 'advice--replace-whole-buffer)
(advice-add 'query-replace :around 'advice--replace-whole-buffer)

(map! :n "C-s" 'replace-string
      :n "C-S-s" 'query-replace)
