doom/config.org
** Spell- and grammar checker
These are the dictionaries I want to use for spell checking.
#+begin_src emacs-lisp
(add-hook 'spell-fu-mode-hook
  (lambda ()
    (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "de"))
    (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "en"))
    ))
(setq ispell-personal-dictionary "~/Dropbox/.aspell.en.pws")
#+end_src
Set path to languagetool.
#+begin_src emacs-lisp
(setq langtool-java-classpath "/usr/share/languagetool/*")
#+end_src
** Snippets
My snippets are mostly to make typing LaTeX fast. I [[https://docs.doomemacs.org/v21.12/modules/editor/snippets/][disable Doom's default snippets]], but then I add some of them back again manually. Some other snippets come from this [[https://karthinks.com/software/latex-input-for-impatient-scholars/#create-math-environments][excellent article by karthink]].
*** Basic YAS settings
This disables the annoying final newline when creating a snippet, which always screws things up.
#+begin_src emacs-lisp
(add-hook 'snippet-mode-hook 'my-snippet-mode-hook)
(defun my-snippet-mode-hook ()
  "Custom behaviours for `snippet-mode'."
  (setq-local require-final-newline nil)
  (setq-local mode-require-final-newline nil))
#+end_src

Hey boy, I heard you like snippets... so I put some snippets in your snippets...
#+begin_src emacs-lisp :tangle yes
(setq yas-triggers-in-field t)
#+end_src

YAS kind of wrecks my undo history sometimes. Maybe this helps.
#+begin_src emacs-lisp
(setq yas-snippet-revival nil)
#+end_src

I use some snippets that modify the surrounding characters of the buffer (e.g. by deleting the space before the snippet). This causes YAS to throw a warning. Let's disable that.
#+begin_src emacs-lisp
(use-package warnings
    :config
    (cl-pushnew '(yasnippet backquote-change)
                warning-suppress-types
                :test 'equal))
#+end_src

*** Where Snippets start
The following variable determines how YAS detects the beginning of a snippet. (This is the default value.)
#+begin_src emacs-lisp
(setq yas-key-syntaxes '(yas-try-key-from-whitespace "w_.()" "w_." "w_" "w"))
#+end_src

One could also be more lenient with snippet expansion by replacing =yas-try-key-from-whitespace= with =yas-longest-key-from-whitespace= in the above. Let's illustrate this with an example. Suppose =bla= is a snippet key that expands to =blub=. Now there's two possibilities:
- Typing =blibla= and hitting tab does nothing, one would need to do =bli bla= and then hit tab to get =bli blup=. This is the default behaviour, achieved by =yas-try-key-from-whitespace=.
- Typing =blibla= and hitting tab expands to =bliblub=. This would achieved by =yas-longest-key-from-whitespace=.
The second sometimes avoids hitting the space key, but sometimes makes snippets expand accidentally. This is especially problematic if you have very short snippet keys that appear as parts of words, and especially especially when auto-expanding (see below).

I've changed my mind on this multiple times, which is why this paragraph of documentation is here. Right now I favor the default behaviour.

*** Avoiding Backslashes
#+begin_src emacs-lisp
(defadvice! include-backslash (oldfun)
  :around #'yas--templates-for-key-at-point
  (setq my-syntax-table (copy-syntax-table (syntax-table)))
  (modify-syntax-entry ?\\ "w" my-syntax-table)
  (with-syntax-table my-syntax-table (funcall oldfun)))
#+end_src
This advice makes YAS think that a backslash has [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Syntax-Class-Table.html][syntax class]] word while detecting the begining of a snippet. In practice this means that backslashes will always be viewed as a part of the (potential) snippet key. For example, if =bla= is a snippet key that expands to =blub=, then =\​bla= will not expand (assuming there is no different snippet with key =\​bla=). The big advantage of this is that I can have e.g. a snippet that auto-expands from =sqrt= to =\​sqrt{}= without screwing things up whenever I type the full command manually after all.

*** Keybindings (and avoiding remappings)
Some nicer shortcuts for creating snippets etc. would also be nice.
Doom however automatically remaps the functions ~yas-new-snippet~ and ~yas-visit-snippet-file~ to the "superior alternatives" ~+snippets/new~ and ~+snippets/edit~ (see [[file:~/.config/emacs/modules/editor/snippets/config.el::;; Replace commands with superior alternatives][~/config/emacs/modules/editor/snippets/config.el, line 81]]). I respectfully disagree with that. My main problem is ~+snippets/new~ doesn't save the snippet in the right folder when creating a snippet for a mode different from the current major mode. Other issues are discussed [[https://github.com/doomemacs/doomemacs/issues/4330][here]]. Since this issue is a bit older and hasn't seen recent activity, I'll opt for a workaround for now.
#+begin_src emacs-lisp
(defun yas-new-snippet-clone (&optional no-template)
  "Clone of `yas-new-snippet' to avoid Doom Emacs remapping keys."
  (interactive "P")
  (yas-new-snippet no-template))
(defun yas-visit-snippet-file-clone (&optional no-template)
  "Clone of `yas-visit-snippet-file' to avoid Doom Emacs remapping keys."
  (interactive)
  (yas-visit-snippet-file))
(map! :leader
      (:prefix ("y" . "YASnippet")
       :desc "edit snippet"             "e" #'yas-visit-snippet-file-clone
       :desc "edit snippet (doom ver.)" "E" #'+snippets/edit
       :desc "insert snippet"           "i" #'yas-insert-snippet
       :desc "new snippet"              "n" #'yas-new-snippet-clone
       :desc "new snippet (doom ver.)"  "N" #'+snippets/new
       :desc "find private snippet"     "p" #'+snippets/find-private
       :desc "reload all snippets"      "r" #'yas-reload-all))
#+end_src
Now let's just make ~yas-new-snippet~ use the same template as ~+snippets/new~:
#+begin_src emacs-lisp
(setq yas-new-snippet-default (concat "# -*- mode: snippet -*-\n"
                                  "# name: $1\n"
                                  "# uuid: $2\n"
                                  "# key: $3\n"
                                  "# condition: ${4:t}\n"
                                  "# --\n"
                                  "$0"))
#+end_src
*** Automatic snippet expansion
YAS has no built-in way to auto-expand snippets, i.e. expand them without hitting tab. Another snippet engine, [[https://github.com/ymarco/auto-activating-snippets][AAS]], was made for this purpose. However, I prefer not dealing with two separate systems at the same time, so I opted for [[https://github.com/joaotavora/yasnippet/issues/998][manually adding auto expanding capabilities to YAS.]] This way, snippets that are marked with the condition ='auto= will be auto-expanded.
#+begin_src emacs-lisp :tangle yes
(defun yas-try-expanding-auto-snippets ()
  (when (and (boundp 'yas-minor-mode) yas-minor-mode)
    (let ((yas-buffer-local-condition ''(require-snippet-condition . auto))
          ;(yas-key-syntaxes '(yas-try-key-from-whitespace "w_.()" "w_." "w_" "w"))
          )
      (yas-expand))))
(add-hook 'post-self-insert-hook #'yas-try-expanding-auto-snippets)
#+end_src
One thing we can do here is temporarily change ~yas-key-syntaxes~. This way we have the option to change the setting [[*Where Snippets start][Where Snippets start]] for automatic snippets only.

*** The TAB key
The tab key is getting intentionally overloaded with snippets, cdlatex and various org-mode things. But one thing that annoyingly interferes with these is autocomplete. Lets unbind the tab key from that and rather use Return for autocomplete and arrow keys (or C-j, C-k) for picking completion suggestions.
#+begin_src emacs-lisp :tangle yes
(after! company
        (map! :map company-search-map
                [tab] nil
                "TAB" nil)
        (map! :map company-active-map
                [tab] nil
                "TAB" nil))
#+end_src

Though sometimes cdlatex and YAS fight for whose turn it is with the tab key. This solves that (cf. [[https://gist.github.com/karthink/7d89df35ee9b7ac0c93d0177b862dadb][karthink]], adapted for doom).
(*TODO*: This makes default values in snippets harder to use. Hitting tab first jumps to the end of the field, and only hitting tab a second time jumps to the next field.)
#+begin_src emacs-lisp
(defun cdlatex-in-yas-field ()
        ;; Check if we're at the end of the Yas field
        (when-let* ((_ (overlayp yas--active-field-overlay))
                        (end (overlay-end yas--active-field-overlay)))
        (if (>= (point) end)
                ;; Call yas-next-field if cdlatex can't expand here
                (let ((s (thing-at-point 'sexp)))
                (unless (and s (assoc (substring-no-properties s)
                                        cdlatex-command-alist-comb))
                (yas-next-field-or-maybe-expand)
                t))
                ;; otherwise expand and jump to the correct location
                (let (cdlatex-tab-hook minp)
                (setq minp
                        (min (save-excursion (cdlatex-tab)
                                        (point))
                        (overlay-end yas--active-field-overlay)))
                (goto-char minp) t))))

(defun yas-next-field-or-cdlatex nil
        (interactive)
        "Jump to the next Yas field correctly with cdlatex active."
        (if
                (or (bound-and-true-p cdlatex-mode)
                (bound-and-true-p org-cdlatex-mode))
                (cdlatex-tab)
        (yas-next-field-or-maybe-expand)))

(after! cdlatex
        (add-hook 'cdlatex-tab-hook 'yas-expand)
        (add-hook 'cdlatex-tab-hook 'cdlatex-in-yas-field))
(after! yasnippet
        (map! :map yas-keymap
                [tab] 'yas-next-field-or-cdlatex
                "TAB" 'yas-next-field-or-cdlatex))
#+end_src

Let's also bind ~cdlatex-tab~ in LaTeX-mode, but wrapped in a function that makes sure we can still insert tabs as long as we're at the beginning of the line:
#+begin_src emacs-lisp
(defun cdlatex-tab-or-indent ()
  "Indent when at the beginning of a line (or if current point is preceeded only by whitespace). Otherwise, call `cdlatex-tab'."
  (interactive)
  (if (or (bolp) (looking-back "^[ \t]+"))
      (indent-for-tab-command)
      (cdlatex-tab)))
(map! :map LaTeX-mode-map
                :i [tab] 'cdlatex-tab-or-indent
                :i "TAB" 'cdlatex-tab-or-indent)
#+end_src

** Performance
*** Font-Lock
I am experiencing a bunch of little performance issues related to font-lock, so syntax highlighting and other visuals of text. One big one seems to be related to having many folded org headings on the screen, so should try to avoid that.

Another one comes in form of lags while typing "long" lines, where long is not actually long, but just a couple hundred characters. This setting delays font-lock for a bit, which seems to help
#+begin_src emacs-lisp :tangle yes
(setq jit-lock-defer-time 0.25)
#+end_src
*** Org-Element Cache
Org-Element hangs when expanding snippets that change the buffer. Got no better solution than to turn it off.
#+begin_src emacs-lisp
(setq org-element-use-cache nil)
#+end_src

