doom/config.el

(add-hook 'spell-fu-mode-hook
  (lambda ()
    (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "de"))
    (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary "en"))
    ))
(setq ispell-personal-dictionary "~/Dropbox/.aspell.en.pws")

(setq langtool-java-classpath "/usr/share/languagetool/*")

(add-hook 'snippet-mode-hook 'my-snippet-mode-hook)
(defun my-snippet-mode-hook ()
  "Custom behaviours for `snippet-mode'."
  (setq-local require-final-newline nil)
  (setq-local mode-require-final-newline nil))

(setq yas-triggers-in-field t)

(setq yas-snippet-revival nil)

(use-package warnings
    :config
    (cl-pushnew '(yasnippet backquote-change)
                warning-suppress-types
                :test 'equal))

(setq yas-key-syntaxes '(yas-try-key-from-whitespace "w_.()" "w_." "w_" "w"))

(defadvice! include-backslash (oldfun)
  :around #'yas--templates-for-key-at-point
  (setq my-syntax-table (copy-syntax-table (syntax-table)))
  (modify-syntax-entry ?\\ "w" my-syntax-table)
  (with-syntax-table my-syntax-table (funcall oldfun)))

(defun yas-new-snippet-clone (&optional no-template)
  "Clone of `yas-new-snippet' to avoid Doom Emacs remapping keys."
  (interactive "P")
  (yas-new-snippet no-template))
(defun yas-visit-snippet-file-clone (&optional no-template)
  "Clone of `yas-visit-snippet-file' to avoid Doom Emacs remapping keys."
  (interactive)
  (yas-visit-snippet-file))
(map! :leader
      (:prefix ("y" . "YASnippet")
       :desc "edit snippet"             "e" #'yas-visit-snippet-file-clone
       :desc "edit snippet (doom ver.)" "E" #'+snippets/edit
       :desc "insert snippet"           "i" #'yas-insert-snippet
       :desc "new snippet"              "n" #'yas-new-snippet-clone
       :desc "new snippet (doom ver.)"  "N" #'+snippets/new
       :desc "find private snippet"     "p" #'+snippets/find-private
       :desc "reload all snippets"      "r" #'yas-reload-all))

(setq yas-new-snippet-default (concat "# -*- mode: snippet -*-\n"
                                  "# name: $1\n"
                                  "# uuid: $2\n"
                                  "# key: $3\n"
                                  "# condition: ${4:t}\n"
                                  "# --\n"
                                  "$0"))

(defun yas-try-expanding-auto-snippets ()
  (when (and (boundp 'yas-minor-mode) yas-minor-mode)
    (let ((yas-buffer-local-condition ''(require-snippet-condition . auto))
          ;(yas-key-syntaxes '(yas-try-key-from-whitespace "w_.()" "w_." "w_" "w"))
          )
      (yas-expand))))
(add-hook 'post-self-insert-hook #'yas-try-expanding-auto-snippets)

(after! company
        (map! :map company-search-map
                [tab] nil
                "TAB" nil)
        (map! :map company-active-map
                [tab] nil
                "TAB" nil))

(defun cdlatex-in-yas-field ()
        ;; Check if we're at the end of the Yas field
        (when-let* ((_ (overlayp yas--active-field-overlay))
                        (end (overlay-end yas--active-field-overlay)))
        (if (>= (point) end)
                ;; Call yas-next-field if cdlatex can't expand here
                (let ((s (thing-at-point 'sexp)))
                (unless (and s (assoc (substring-no-properties s)
                                        cdlatex-command-alist-comb))
                (yas-next-field-or-maybe-expand)
                t))
                ;; otherwise expand and jump to the correct location
                (let (cdlatex-tab-hook minp)
                (setq minp
                        (min (save-excursion (cdlatex-tab)
                                        (point))
                        (overlay-end yas--active-field-overlay)))
                (goto-char minp) t))))

(defun yas-next-field-or-cdlatex nil
        (interactive)
        "Jump to the next Yas field correctly with cdlatex active."
        (if
                (or (bound-and-true-p cdlatex-mode)
                (bound-and-true-p org-cdlatex-mode))
                (cdlatex-tab)
        (yas-next-field-or-maybe-expand)))

(after! cdlatex
        (add-hook 'cdlatex-tab-hook 'yas-expand)
        (add-hook 'cdlatex-tab-hook 'cdlatex-in-yas-field))
(after! yasnippet
        (map! :map yas-keymap
                [tab] 'yas-next-field-or-cdlatex
                "TAB" 'yas-next-field-or-cdlatex))

(defun cdlatex-tab-or-indent ()
  "Indent when at the beginning of a line (or if current point is preceeded only by whitespace). Otherwise, call `cdlatex-tab'."
  (interactive)
  (if (or (bolp) (looking-back "^[ \t]+"))
      (indent-for-tab-command)
      (cdlatex-tab)))
(map! :map LaTeX-mode-map
                :i [tab] 'cdlatex-tab-or-indent
                :i "TAB" 'cdlatex-tab-or-indent)

(setq jit-lock-defer-time 0.25)

(setq org-element-use-cache nil)
