doom/config.el

(defun helpful-toggle-edebug-query ()
  "Query the user for a function, and then toggle edebug for that function using `helpful--toggle-edebug'."
  (interactive)
  (helpful--toggle-edebug (car (help-fns--describe-function-or-command-prompt))))

(map! :leader
      (:prefix ("d" . "debugging")
       :desc "edebug defun at point"            "d" #'edebug-defun
       :desc "debug on entry"                   "e" #'debug-on-entry
       :desc "cancel debug on entry"            "E" #'cancel-debug-on-entry
       :desc "toggle edebug for function"       "f" #'helpful-toggle-edebug-query
       :desc "remove edebug from function"      "F" #'edebug-remove-instrumentation
       :desc "view echo area messages"          "m" #'view-echo-area-messages
       :desc "start/stop profiler"              "p" #'doom/toggle-profiler
       :desc "trace function"                   "r" #'trace-function
       :desc "open sandbox"                     "s" #'doom/sandbox
       :desc "toggle debug on error"            "t" #'toggle-debug-on-error
       :desc "untrace function"                 "u" #'untrace-function
       :desc "untrace all functions"            "U" #'untrace-all
       :desc "debug on variable change"         "v" #'debug-on-variable-change
       :desc "cancel debug on variable change"  "V" #'cancel-debug-on-variable-change))

(setq ;org-directory "~/org/"
      org-roam-directory "~/Dropbox/roam"
      org-cd-directory (concat org-roam-directory "/tikz-cd")) ; for commutative diagrams
;;(setq org-agenda-files (list "~/org/todo.org" "~/org/lv_Sommer2023.org"))
(setq org-agenda-files nil) ;currently not using org-agenda
(setq org-directory nil) ;currently not using org-agenda

(after! org-modern
  (setq org-modern-star 'replace
        org-modern-replace-stars "❭"
        org-modern-list '((?+ . "✦") (?- . "➤"))
        org-modern-todo nil
        org-modern-table nil
        org-modern-timestamp '(" %d. %b %Y " . " %H:%M ")))
(after! org
  (setq org-ellipsis " ▼ "
        org-hide-emphasis-markers t
        org-appear-autoemphasis t
        org-appear-autosubmarkers t
        org-appear-autolinks nil
        org-hidden-keywords '(title)
        org-image-align 'center
        org-todo-keyword-faces '(("WAIT" . "#ECBE7B")
                                ("TODELEGATE" . "pink")
                                ("IDEA" . "cyan")
                                ("DONE" . "#5b8c68")
                                ("DELEGATED" . "#a9a1e1")
                                ("CANCELLED" . "#ff6c6b"))))
(custom-set-faces!
  `(org-level-1 :inherit outline-1 :height 1.4)
  `(org-level-2 :inherit outline-2 :height 1.25)
  `(org-level-3 :inherit outline-3 :height 1.1)
  `(org-level-4 :inherit outline-4 :height 1.05)
  `(org-level-5 :inherit outline-5 :height 1.0)
  `(org-document-title :family "K2D" :foreground "#9BDB4D" :background nil :height 2.0))

(after! org
  (setq org-pretty-entities-include-sub-superscripts nil))

(after! org
  (setq
        org-log-done 'time
        org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-deadline-warning-days 7
        org-todo-keywords '((sequence
             "TODO(t)"
             "WAIT(w)"
             "TODELEGATE(T)"
             "IDEA(i)"
             "|"
             "DONE(d)"
             "DELEGATED(D)"
             "CANCELLED(c)" ))))

(setq org-roam-default-template '("d" "default" plain "%?" :target
            (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+filetags: :draft:\n#+title: ${title}\n\n")
        :unnarrowed t :immediate-finish t))

(setq org-roam-capture-templates (list org-roam-default-template))

(defun org-roam-node-insert-default (&optional FILTER-FN &key INFO)
        "org-roam-node-insert, but it always uses the default template"
        (interactive)
        (org-roam-node-insert FILTER-FN :templates (list org-roam-default-template) :info INFO))
(defun org-roam-node-find-default (&optional OTHER-WINDOW INITIAL-INPUT FILTER-FN PRED)
        "org-roam-node-find, but it always uses the default template"
        (interactive current-prefix-arg)
        (org-roam-node-find OTHER-WINDOW INITIAL-INPUT FILTER-FN PRED :templates (list org-roam-default-template)))
(defun org-roam-capture-default (&optional GOTO KEYS &key FILTER-FN INFO)
        "org-roam-capture, but it always uses the default template"
        (interactive "P")
        (org-roam-capture GOTO KEYS :filter-fn FILTER-FN :templates (list org-roam-default-template) :info INFO))

(defadvice org-roam-node-insert (around append-if-in-evil-normal-mode activate compile)
  "If in evil normal mode and cursor is on a whitespace character, then go into
append mode first before inserting the link. This is to put the link after the
space rather than before."
  (let ((is-in-evil-normal-mode (and (bound-and-true-p evil-mode)
                                     (not (bound-and-true-p evil-insert-state-minor-mode))
                                     (looking-at "[[:blank:]]"))))
    (if (not is-in-evil-normal-mode)
        ad-do-it
      (evil-append 0)
      ad-do-it
      (evil-normal-state))))

(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start nil))
