doom/config.org
*** Commutative Diagrams
I want to use commutative diagrams in some of my roam notes, using the LaTeX-package ~tikz-cd~. However, doing that in LaTeX fragments doesn't work with ~org-roam-ui~ (since that just uses KaTeX, which doesn't support everything in LaTeX). On the other hand, doing it using src-blocks is also not great, cause then the distracting source code is gonna appear both in org and in the UI.

My solution to that is creating a capture template for commutative diagrams (inspired by [[https://github.com/darknmt/org-tikzcd-snippet][this]]). This is done using regular ~org-capture~, since I don't want those files to have IDs and show up in my roam database. This works as follows:
 - Upon running ~org-capture-commutative-diagram~, the user is first prompted for a file name.
 - Afterwards, an org file is created, where the file name is prefixed with a time stamp. The file already contains a ~tikz-cd~ block, and all options necessary for export.
 - Now the user may type the commutative diagram of their dreams.
 - After completing the capture with =C-c C-c=, the diagram will be rendered to a png image by LaTeX/imagemagick. After this is finished, the capture buffer closes, and a link to the image is inserted in the previously opened buffer.

For the actual capture template: The code is passed both through ~format~ and through ~org-capture~, which necessitates double escaping quotations and backspaces. This makes it super hard to read, so I suggest you just try it out if you wanna see what it does. ^^ The ~%%~ is a masked percentage sign btw.
Also there are checks in place to make sure the functions place in ~org-capture~-hooks are only run when actually creating a commutative diagram (cf. [[https://emacs.stackexchange.com/a/48567][stackexchange]]).
#+begin_src emacs-lisp :tangle yes
(defun commutative-diagram-filename-generate ()
  (setq commutative-diagram-filename--name (read-string "Name: "))
  (setq commutative-diagram-filename--time (format-time-string "%Y%m%d%H%M%S"))
  (setq commutative-diagram-filename--image (expand-file-name (format "%s-%s.png" commutative-diagram-filename--time commutative-diagram-filename--name) org-cd-directory))
  (setq commutative-diagram-filename--org (expand-file-name (format "%s-%s.org" commutative-diagram-filename--time commutative-diagram-filename--name) org-cd-directory)))

(after! org-capture (add-to-list 'org-capture-templates
  '("c" "Commutative Diagram" plain
     (file commutative-diagram-filename-generate)
     "%(format \"#+TITLE: %s\n#+STAMP: %s\n#+HEADER: :imagemagick yes :iminoptions -density 600 -geometry 1500 :buffer no :fit yes \n#+HEADER: :results raw  :file %s-%s.png \n#+HEADER: :packages '((\\\"\\\" \\\"tikz-cd\\\")) \n#+HEADER: :exports results :results output graphics file \n#+BEGIN_SRC latex \n\\\\begin{tikzcd}[white]\n %%? \n\\\\end{tikzcd}\n#+END_SRC\" commutative-diagram-filename--name commutative-diagram-filename--time commutative-diagram-filename--time commutative-diagram-filename--name)")))

(defun org-capture-commutative-diagram--render ()
    (when (and (not org-note-abort) (equal (plist-get org-capture-plist :key) "c")) ; execute only for the commutative diagram capture template
    (org-babel-execute-buffer)))
(after! org-capture (add-hook 'org-capture-before-finalize-hook 'org-capture-commutative-diagram--render))

(defun org-capture-commutative-diagram--insert-link () (interactive)
  (when (and (not org-note-abort) (equal (plist-get org-capture-plist :key) "c")) ; execute only for the commutative diagram capture template
    (evil-open-below 1)
    (insert "[[" commutative-diagram-filename--image "]]\n")
    (evil-normal-state)
    (org-redisplay-inline-images)
))
(after! org-capture (add-hook 'org-capture-after-finalize-hook 'org-capture-commutative-diagram--insert-link))

(defun org-capture-commutative-diagram () (interactive)
    (org-capture nil "c")
)
#+end_src
*** Keybindings
Basically taking the default keybindings and moving them to ~SPC r~, which was still free.
Only change is that I'm using ~org-roam-ui~ for the graph.
#+begin_src emacs-lisp :tangle yes
(map! :leader
      (:prefix ("r" . "roam")
         :desc "Open random node"                       "0" #'org-roam-node-random
         :desc "Find node (default template)"           "f" #'org-roam-node-find-default
         :desc "Find node (choose template)"            "F" #'org-roam-node-find
         :desc "Show UI"                                "g" #'org-roam-ui-open
         :desc "Insert node (default template)"         "i" #'org-roam-node-insert-default
         :desc "Insert node (choose template)"          "I" #'org-roam-node-insert
         :desc "Insert implication"                     "j" #'org-roam-implication-insert
         :desc "Tag link as implication"                "J" #'org-roam-implication-tag
         :desc "Capture to node (default template)"     "n" #'org-roam-capture-default
         :desc "Capture to node (choose template)"      "N" #'org-roam-capture
         :desc "Toggle roam buffer"                     "r" #'org-roam-buffer-toggle
         :desc "Launch roam buffer"                     "R" #'org-roam-buffer-display-dedicated
         :desc "Sync database"                          "s" #'org-roam-db-sync
         :desc "Add tag"                                "t" #'org-roam-tag-add
         :desc "Remove tag"                             "T" #'org-roam-tag-remove
         :desc "Set link tags"                          "l" #'org-link-set-tags
         :desc "Remove link tags"                       "L" #'org-link-remove-tags
         :desc "Add alias"                              "a" #'org-roam-alias-add
         :desc "Remove alias"                           "A" #'org-roam-alias-remove
         :desc "Commutative diagram"                    "c" #'org-capture-commutative-diagram
         (:prefix ("d" . "by date")
          :desc "Goto previous note"                    "b" #'org-roam-dailies-goto-previous-note
          :desc "Goto date"                             "d" #'org-roam-dailies-goto-date
          :desc "Capture date"                          "D" #'org-roam-dailies-capture-date
          :desc "Goto next note"                        "f" #'org-roam-dailies-goto-next-note
          :desc "Goto tomorrow"                         "m" #'org-roam-dailies-goto-tomorrow
          :desc "Capture tomorrow"                      "M" #'org-roam-dailies-capture-tomorrow
          :desc "Capture today"                         "n" #'org-roam-dailies-capture-today
          :desc "Goto today"                            "t" #'org-roam-dailies-goto-today
          :desc "Capture today"                         "T" #'org-roam-dailies-capture-today
          :desc "Goto yesterday"                        "y" #'org-roam-dailies-goto-yesterday
          :desc "Capture yesterday"                     "Y" #'org-roam-dailies-capture-yesterday
          :desc "Find directory"                        "-" #'org-roam-dailies-find-directory)))
#+end_src

Then additionally, I want quick control over the UI from the local leader.
#+begin_src emacs-lisp
(map! :after org
    :map org-mode-map
    :localleader
    :prefix ("u" . "org-roam-ui")
    "o" #'org-roam-ui-open
    "z" #'org-roam-ui-node-zoom
    "l" #'org-roam-ui-node-local
    "T" #'org-roam-ui-sync-theme
    "f" #'org-roam-ui-follow-mode
    "a" #'org-roam-ui-add-to-local-graph
    "c" #'org-roam-ui-change-local-graph
    "r" #'org-roam-ui-remove-from-local-graph)
#+end_src
*** Roam Pseudohook
It'd be nice to be able to toggle some settings only for roam notes. Usually this would be done via the hook of a mode. But roam notes are just org files, and I don't want those settings on all org files. So let's create something I'll call a "pseudohook". The function will run the hook if the current buffer file name is in ~org-roam-directory~. By adding this function to ~org-mode-hook~, the ~roam-pseudohook~ will apply exactly to the org files in ~org-roam-directory~.
#+begin_src emacs-lisp :tangle yes
(defvar roam-pseudohook nil
 "A hook run only on org files in org-roam-directory.")
(defun roam-pseudohook-function ()
  (cond ((string-prefix-p org-roam-directory (buffer-file-name))
         (run-hooks 'roam-pseudohook)
         )))
(after! org (add-hook 'org-mode-hook 'roam-pseudohook-function))
#+end_src
*** Appearance
I want org roam notes to have special appearance.
#+begin_src emacs-lisp :tangle yes
(add-hook 'roam-pseudohook (lambda () (setq-local +word-wrap-fill-style 'soft) (+word-wrap-mode 1)))
(add-hook 'roam-pseudohook (lambda () (mixed-pitch-mode 1)))
#+end_src
Writeroom mode isn't a great idea during capture buffers. Let's add a hook to ~org-capture-mode~ to disable it.
#+begin_src emacs-lisp :tangle yes
(defun writeroom-mode-deactivate () (writeroom-mode -1))
(add-hook 'org-roam-capture-new-node-hook 'writeroom-mode-deactivate)
(add-hook 'org-capture-mode-hook 'writeroom-mode-deactivate)
#+end_src
I want to see my tags when searching for notes.
#+begin_src emacs-lisp :tangle yes
(setq org-roam-node-display-template
      (concat "${title:*} "
              (propertize "${tags:30}" 'face 'org-tag))) ; 30 is the max. number of characters allocated for tags
#+end_src
** Org LaTeX previews
