doom/config.org
** Note Taking
Literature notes get their own subfolder.
#+begin_src emacs-lisp
(setq citar-org-roam-subdir "/home/reiti/Dropbox/roam/literature")
#+end_src

The defaults for [[https://github.com/emacs-citar/citar-org-roam][citar-org-roam]] are pretty great already, I just want to modify the template a little. Let's start with the title:
#+begin_src emacs-lisp
(setq citar-org-roam-note-title-template "${author} - ${title}")
#+end_src

Now the rest of the template. I want to have a link to the relevant pdf file in the note, if that exists. The intended way of achieving this is by extending ~citar-org-roam-template-fields~ to be able to automatically insert the file path of our reference like so:
#+begin_src emacs-lisp :tangle no
(setq citar-org-roam-template-fields '(
        (:citar-title "title")
        (:citar-author "author" "editor")
        (:citar-date "date" "year" "issued")
        (:citar-pages "pages")
        (:citar-type "=type=")
        (:citar-file "file" "pdf")))
#+end_src
Unfortunately, in case the ~file~-entry of our bibliography entry is empty, this method will query the user for a filename (before evaluating any code that would eliminate empty strings). I don't want this, since I clearly don't have the file. So let's use ~citar-get-value~ instead and check for the empty sting that way.
#+begin_src emacs-lisp
(add-to-list 'org-roam-capture-templates
  '("l" "Literature Note" plain
        "%?"
        :target
        (file+head
         "%(expand-file-name (or citar-org-roam-subdir \"\") org-roam-directory)/${citar-citekey}.org"
         ":PROPERTIES:\n:NOTER_DOCUMENT: %(if (string= \"\" \"%(citar-get-value \"file\" \"${citar-citekey}\")\") ( ) (print \"%(citar-get-value \"file\" \"${citar-citekey}\")\"))\n:NOTER_PAGE: 1\n:END:\n#+title: ${note-title}\n%(if (string= \"\" \"%(citar-get-value \"file\" \"${citar-citekey}\")\") (print \"${citar-citekey}\") (print \"[[file:%(citar-get-value \"file\" \"${citar-citekey}\")][${citar-citekey}]]\")), ${citar-date}\n\n")
        :unnarrowed t
     ) t)
#+end_src
Finally, we gotta tell ~citar-org-roam~ to use this template.
#+begin_src emacs-lisp
(setq citar-org-roam-capture-template-key "l")
#+end_src
** Appearance
Even though the [[https://github.com/emacs-citar/citar/wiki/Indicators][citar documentation]] suggests otherwise, adding the ~+icons~ flag to dooms ~:biblio~ module doesn't do anything for me. So let's prettify it manually:
#+begin_src emacs-lisp
(after! citar
    (defvar citar-indicator-files-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-file_o"
                :face 'nerd-icons-green
                :v-adjust -0.1)
       :function #'citar-has-files
       :padding "  " ; need this because the default padding is too low for these icons
       :tag "has:files"))
    (defvar citar-indicator-links-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-link"
                :face 'nerd-icons-orange
                :v-adjust 0.01)
       :function #'citar-has-links
       :padding "  "
       :tag "has:links"))
    (defvar citar-indicator-notes-icons
      (citar-indicator-create
       :symbol (nerd-icons-codicon
                "nf-cod-note"
                :face 'nerd-icons-blue
                :v-adjust -0.3)
       :function #'citar-has-notes
       :padding "    "
       :tag "has:notes"))
    (defvar citar-indicator-cited-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-circle_o"
                :face 'nerd-icon-green)
       :function #'citar-is-cited
       :padding "  "
       :tag "is:cited"))
    (setq citar-indicators
       (list citar-indicator-files-icons
                citar-indicator-links-icons
                citar-indicator-notes-icons
                citar-indicator-cited-icons)))
#+end_src
** Keybindings
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("l" . "literature")
         :desc "Insert Citation"        "@" #'citar-insert-citation
         :desc "Attach Files"           "a" #'citar-attach-files
         :desc "Open Files"             "f" #'citar-open-files
         :desc "Insert Citation"        "i" #'citar-insert-citation
         :desc "Insert Citekey"         "I" #'citar-insert-keys
         :desc "Open Notes"             "n" #'citar-open-notes
         :desc "Open Existing Note"     "N" #'org-roam-ref-find
         :desc "Open"                   "o" #'citar-open
         :desc "Insert Reference"       "r" #'citar-insert-reference))
(map! :localleader :map evil-tex-mode-map :desc "Insert quick citation" "@"
        (lambda () (interactive) (let ((current-prefix-arg '(4))) ; call with C-u prefix argument
                                   (call-interactively #'citar-insert-citation))))
#+end_src
** PDF-Tools
Some nicer keybindings.
#+begin_src emacs-lisp
(map! :after pdf-tools :localleader :map pdf-view-mode-map
      :desc "auto slice mode" "s" 'pdf-view-auto-slice-minor-mode
      :desc "midnight mode" "m" 'pdf-view-midnight-minor-mode
      :desc "themed mode" "t" 'pdf-view-themed-minor-mode
      :desc "printer mode" "p" 'pdf-view-printer-minor-mode
      (:prefix ("f" . "fit")
         :desc "fit page to window"     "p" #'pdf-view-fit-page-to-window
         :desc "fit width to window"    "w" #'pdf-view-fit-width-to-window
         :desc "fit height to window"   "h" #'pdf-view-fit-height-to-window))

(map! :after pdf-tools :map pdf-view-mode-map
      "<normal-state> C-f" 'pdf-view-next-page-command
      "<normal-state> C-b" 'pdf-view-previous-page-command
      :desc "midnight mode" "m" 'pdf-view-midnight-minor-mode
      ;; free up window navigation keys
      "C-j" nil
      "C-l" nil
      "C-k" nil
      "<normal-state> C-j" nil
      "<normal-state> C-l" nil
      "<normal-state> C-k" nil
      ;; org-noter keybindings
      "<normal-state> <remap> <evil-insert>" nil
      "<normal-state> i" 'org-noter-insert-note
      "i" 'org-noter-insert-note
      "<normal-state> <remap> <evil-insert-line>" nil
      "<normal-state> I" 'org-noter-insert-precise-note
      "I" 'org-noter-insert-precise-note)
#+end_src

The doom one theme doesn't actually look too great for PDFs in my opinion. [[https://blog.karenying.com/posts/50-shades-of-dark-mode-gray][This blog post]] helped me pick something better:
#+begin_src emacs-lisp
(setq pdf-view-midnight-colors '("#E4E6EB" . "#18191A"))
#+end_src

And now let's make everything behave the way I want from the get-go.
#+begin_src emacs-lisp
(add-hook! 'pdf-view-mode-hook :append #'pdf-view-auto-slice-minor-mode #'pdf-view-themed-minor-mode #'pdf-view-fit-width-to-window)
#+end_src
** Org Noter
#+begin_src emacs-lisp
(after! org-noter
  (org-noter-enable-org-roam-integration))
(setq! org-noter-always-create-frame nil
       org-noter-kill-frame-at-session-end nil
       org-noter-prefer-root-as-file-level t)

(map! :after org :localleader :map org-mode-map
      "N" 'org-noter)
#+end_src

* Tangle this file!

Tangle on save? Reload after tangle? These hooks will ask you after every save.

;; Local Variables:
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Reload?")(doom/reload))) nil t)
;; eval: (add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Tangle?")(org-babel-tangle))) nil t)
;; End:
