doom/config.el

(setq citar-org-roam-subdir "/home/reiti/Dropbox/roam/literature")

(setq citar-org-roam-note-title-template "${author} - ${title}")

(add-to-list 'org-roam-capture-templates
  '("l" "Literature Note" plain
        "%?"
        :target
        (file+head
         "%(expand-file-name (or citar-org-roam-subdir \"\") org-roam-directory)/${citar-citekey}.org"
         ":PROPERTIES:\n:NOTER_DOCUMENT: %(if (string= \"\" \"%(citar-get-value \"file\" \"${citar-citekey}\")\") ( ) (print \"%(citar-get-value \"file\" \"${citar-citekey}\")\"))\n:NOTER_PAGE: 1\n:END:\n#+title: ${note-title}\n%(if (string= \"\" \"%(citar-get-value \"file\" \"${citar-citekey}\")\") (print \"${citar-citekey}\") (print \"[[file:%(citar-get-value \"file\" \"${citar-citekey}\")][${citar-citekey}]]\")), ${citar-date}\n\n")
        :unnarrowed t
     ) t)

(setq citar-org-roam-capture-template-key "l")

(after! citar
    (defvar citar-indicator-files-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-file_o"
                :face 'nerd-icons-green
                :v-adjust -0.1)
       :function #'citar-has-files
       :padding "  " ; need this because the default padding is too low for these icons
       :tag "has:files"))
    (defvar citar-indicator-links-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-link"
                :face 'nerd-icons-orange
                :v-adjust 0.01)
       :function #'citar-has-links
       :padding "  "
       :tag "has:links"))
    (defvar citar-indicator-notes-icons
      (citar-indicator-create
       :symbol (nerd-icons-codicon
                "nf-cod-note"
                :face 'nerd-icons-blue
                :v-adjust -0.3)
       :function #'citar-has-notes
       :padding "    "
       :tag "has:notes"))
    (defvar citar-indicator-cited-icons
      (citar-indicator-create
       :symbol (nerd-icons-faicon
                "nf-fa-circle_o"
                :face 'nerd-icon-green)
       :function #'citar-is-cited
       :padding "  "
       :tag "is:cited"))
    (setq citar-indicators
       (list citar-indicator-files-icons
                citar-indicator-links-icons
                citar-indicator-notes-icons
                citar-indicator-cited-icons)))

(map! :leader
      (:prefix ("l" . "literature")
         :desc "Insert Citation"        "@" #'citar-insert-citation
         :desc "Attach Files"           "a" #'citar-attach-files
         :desc "Open Files"             "f" #'citar-open-files
         :desc "Insert Citation"        "i" #'citar-insert-citation
         :desc "Insert Citekey"         "I" #'citar-insert-keys
         :desc "Open Notes"             "n" #'citar-open-notes
         :desc "Open Existing Note"     "N" #'org-roam-ref-find
         :desc "Open"                   "o" #'citar-open
         :desc "Insert Reference"       "r" #'citar-insert-reference))
(map! :localleader :map evil-tex-mode-map :desc "Insert quick citation" "@"
        (lambda () (interactive) (let ((current-prefix-arg '(4))) ; call with C-u prefix argument
                                   (call-interactively #'citar-insert-citation))))

(map! :after pdf-tools :localleader :map pdf-view-mode-map
      :desc "auto slice mode" "s" 'pdf-view-auto-slice-minor-mode
      :desc "midnight mode" "m" 'pdf-view-midnight-minor-mode
      :desc "themed mode" "t" 'pdf-view-themed-minor-mode
      :desc "printer mode" "p" 'pdf-view-printer-minor-mode
      (:prefix ("f" . "fit")
         :desc "fit page to window"     "p" #'pdf-view-fit-page-to-window
         :desc "fit width to window"    "w" #'pdf-view-fit-width-to-window
         :desc "fit height to window"   "h" #'pdf-view-fit-height-to-window))

(map! :after pdf-tools :map pdf-view-mode-map
      "<normal-state> C-f" 'pdf-view-next-page-command
      "<normal-state> C-b" 'pdf-view-previous-page-command
      :desc "midnight mode" "m" 'pdf-view-midnight-minor-mode
      ;; free up window navigation keys
      "C-j" nil
      "C-l" nil
      "C-k" nil
      "<normal-state> C-j" nil
      "<normal-state> C-l" nil
      "<normal-state> C-k" nil
      ;; org-noter keybindings
      "<normal-state> <remap> <evil-insert>" nil
      "<normal-state> i" 'org-noter-insert-note
      "i" 'org-noter-insert-note
      "<normal-state> <remap> <evil-insert-line>" nil
      "<normal-state> I" 'org-noter-insert-precise-note
      "I" 'org-noter-insert-precise-note)

(setq pdf-view-midnight-colors '("#E4E6EB" . "#18191A"))

(add-hook! 'pdf-view-mode-hook :append #'pdf-view-auto-slice-minor-mode #'pdf-view-themed-minor-mode #'pdf-view-fit-width-to-window)

(after! org-noter
  (org-noter-enable-org-roam-integration))
(setq! org-noter-always-create-frame nil
       org-noter-kill-frame-at-session-end nil
       org-noter-prefer-root-as-file-level t)

(map! :after org :localleader :map org-mode-map
      "N" 'org-noter)
